/* 
 Localizable.strings
 Replicon
 
 Created by Dipta Rakshit on 1/2/12.
 Copyright (c) 2012 Replicon. All rights reserved.
 */
//AddDescriptionViewController

"TEST"="TEST";

//AddDesriptionViewController

"Cancel" = "Cancel";
"Done" = "Done";
"Clear" = "Clear";

//AddNewTimeEntryViewController

"Do you want to unsubmit and add the entry?"="Do you want to unsubmit and add the entry?";
"This entry is dated for a submitted timesheet."="This entry is dated for a submitted timesheet.";
"Unsubmit"="Unsubmit";


//AddNewExpenseViewController

"Add Expense" = "Add Expense";
"Add"= "Add";
"Save" = "Save";
"None" = "None";
"Expense" = "Expense";
"Please select a project first" = "Please select a project first";
"Please select an expense type first" = "Please select an expense type first";
"Detail" = "Detail";
"Your device is offline.  Please try again when your device is online." = "Your device is offline.  Please try again when your device is online.";
"Please select expense type" = "Please select expense type";
"Please enter Amount" = "Please enter Amount";
"Please select expense type" = "Please select expense type";
"Choose from library" = "Choose from library";
"Connection failed" = "Connection failed";


//AmountViewController

"Amount" = "Amount";
"Total Amount" = "Total Amount";
"Please enter expense amount" = "Please enter expense amount";
"Currency"="Currency";


//CustomPickerView

"Previous" = "Previous";
"Next" = "Next";

//CustomTableHeaderView

"Same As Previous Entry" ="Same As Previous Entry";
"The following time entries are missing required fields:" = "The following time entries are missing required fields:";


//EditExpenseEntryViewController

"Select" = "Select";
"Take photo" = "Take photo";
"Edit Expense" = "Edit Expense";
"Delete" = "Delete";
"This receipt cannot be viewed while offline"="This receipt cannot be viewed while offline";
"View Expense Entry"="View Expense Entry";
"Add Expense Entry"="Add Expense Entry";
"Edit Expense Entry"="Edit Expense Entry";

//EntriesTableFooterView

"TOTAL" = "TOTAL";
"Resubmit" = "Resubmit";
"Submit" = "Submit";
"Unsubmit" = "Unsubmit";


//HomeViewController

"New Time Entry" = "New Time Entry";
"Expenses" = "Expenses";
"Timesheets" = "Timesheets";
"Time Off" = "Time Off";
"Settings" = "Settings";
"You cannot enter time because no projects are assigned to you." = "You cannot enter time because no projects are assigned to you.";
"You cannot enter time because no activities are assigned to you." = "You cannot enter time because no activities are assigned to you.";

"Loading..." = "Loading...";
"Saving..." = "Saving...";
"Submitting..." = "Submitting...";
"Unsubmitting..." = "Unsubmitting...";
"Deleting..." = "Deleting...";


//ListOfExpenseEntriesViewController

"Reimbursement" = "Reimbursement";
"You cannot enter expenses because you do not have any projects assigned." = "You cannot enter expenses because you do not have any projects assigned.";
"There are no available Expense Types." = "There are no available Expense Types.";
"There are no expenses in this sheet." = "There are no expenses in this sheet.";
"Total" = "Total";


//ListOfExpenseSheetsViewController

"More" = "More";
"Approved" = "Approved";
"Not Submitted" = "Not Submitted";
"Waiting For Approval" = "Waiting For Approval";
"Rejected" = "Rejected";


//ListOfTimeEntriesViewController

"Timesheet" = "Timesheet";
"timesheet"="timesheet";
"is a required field but is not accessible through Replicon Mobile." = "is a required field but is not accessible through Replicon Mobile.";
"Add First Time Entry"="Add First Time Entry";


//LoginPreferencesViewController


"Remember Password" = "Remember Password";
"Choose how long to save the password" = "Choose how long to save the password";
"If the password is saved, you will be automatically logged in." = "If the password is saved, you will be automatically logged in.";
"Never" = "Never";
"1 day" = "1 day";
"1 week" = "1 week";
"2 weeks" = "2 weeks";
"1 month" = "1 month";
"Always" = "Always";


//LoginService

"Close" = "Close";
"Go To Website" = "Go To Website";
"Incorrect Login or Password" = "Incorrect Login or Password";
"OK" = "OK";
"The Replicon features you use are currently not supported by the Replicon Mobile app. \n\n Look for additional features to be added in future versions." = "The Replicon features you use are currently not supported by the Replicon Mobile app. \n\n Look for additional features to be added in future versions.";


//LoginViewCell

"Company" = "Company";
"Login" = "Login";
"Password" = "Password";


//LoginViewController

"Please Sign in." = "Please Sign in.";
"Welcome!" = "Welcome!";
"Sign In" = "Sign In";
"Please complete all fields" = "Please complete all fields";
"Forgot your password?"="Forgot your password?";
"(opens link in Safari)"="(opens link in Safari)";


//MoreViewController

"Logout" = "Logout";
"Login Settings" = "Login Settings";
"Remember Company" = "Remember Company";
"Remember Login Name" = "Remember Login Name";
"Remember Password" = "Remember Password";
"Feedback for Replicon Mobile v" = "Feedback for Replicon Mobile v";

//NewExpenseSheetViewController

"New Expense Sheet" = "New Expense Sheet";
"Description" = "Description";
"Please provide a description" = "Please provide a description";


//ReceiptsViewController

"Permanently delete photo receipt?" = "Permanently delete photo receipt?";



//ResubmitTimesheetViewController


"Please indicate reasons for resubmitting this timesheet" = "Please indicate reasons for resubmitting this timesheet";


//RootTabBarController

"Punch Clock" = "Punch Clock";


//SubmissionErrorViewController 

"Back" = "Back";


//SubmittedDetailsView


"DETAILS" = "DETAILS";
"Status" = "Status";
"Approvers" = "Approvers";
"History" = "History";
"Submitted" = "Submitted";
"Unsubmit This Expense Sheet" = "Unsubmit This Expense Sheet";


//SupportDataService

"Your session has expired.  Please log in again." = "Your session has expired.  Please log in again.";
"Your password has been changed since you last logged in.  Please log in using your new password." = "Your password has been changed since you last logged in.  Please log in using your new password.";


//TaskViewController

"Task" = "Task";




//TimeEntryViewController


"Edit Time Entry" = "Edit Time Entry";
"View Time Entry" = "View Time Entry";
"Add Time Entry" = "Add Time Entry";
"Time" = "Time";
"Comments" = "Comments";
"There are no tasks in this project." = "There are no tasks in this project.";
"Do you want to unsubmit and add the entry?" = "Do you want to unsubmit and add the entry?";
"This entry is dated for a submitted timesheet." = "This entry is dated for a submitted timesheet.";
"Please select another date." = "Please select another date.";
"The selected expense type is not valid for this project." = "The selected expense type is not valid for this project.";
"Disabled" = "Disabled";
"Enabled" = "Enabled";


//TransitionPageViewController

"You don't have permission to use the Replicon Mobile app." = "You don't have permission to use the Replicon Mobile app.";

//Util

"Your device is offline.  Please try again when your device is online." = "Your device is offline.  Please try again when your device is online.";
"No Internet Connectivity" = "No Internet Connectivity";
"Internet Error" = "Internet Error";
"ResponseRetrievalError" = "ResponseRetrievalError";


//AdhocTimeOffViewController

"Time Off Entry" = "Time Off Entry";


//CalculatorViewController

"Calulator" = "Calulator";
"ok"="ok";


//ClientProjectTaskViewController

"Project" = "Project";
"Project/Task" = "Project/Task";


//PunchClockViewController

"The timesheet has been modified since your last action.  Your last action has been discarded" = "The timesheet has been modified since your last action.  Your last action has been discarded";
"The timesheet has been modified since your last action.  The app is now up to date.  Please try punching in/out again."="The timesheet has been modified since your last action.  The app is now up to date.  Please try punching in/out again.";
"Punch In" = "Punch In";
"Punch Out" = "Punch Out";
"PUNCH IN:" = "PUNCH IN:";
"OFF CLOCK:" = "OFF CLOCK:";
"ON CLOCK:" = "ON CLOCK:";
"PUNCH OUT:"="PUNCH OUT:";



//UrlReader

/*"Your Replicon permissions have been changed.\n\nPlease log out and log in again to refresh the permissions in the mobile app." = "Your Replicon permissions have been changed.\n\nPlease log out and log in again to refresh the permissions in the mobile app.";*/
"Sorry, there seems to be a technical problem. We've noted your issue and are working hard to resolve it."="Sorry, there seems to be a technical problem. We've noted your issue and are working hard to resolve it.";
"An item you modified or selected was deleted by another user.\n\nPlease log out and log in again to refresh the data in the mobile app." = "An item you modified or selected was deleted by another user.\n\nPlease log out and log in again to refresh the data in the mobile app.";

//FreeTrialViewController

"Please enter your First Name"="Please enter your First Name";
"Please enter your Last Name"="Please enter your Last Name";
"Please enter your Phone No"="Please enter your Phone No";
"Please enter a valid E-mail Address"="Please enter a valid E-mail Address";
"Please enter your Email"="Please enter your Email";
"Please enter your Company Name"="Please enter your Company Name";
"Please enter your Password"="Please enter your Password";
"Passwords Does Not Match"="Passwords Does Not Match";
"Free Trial"="Free Trial";
"Start Using Replicon Now"="Start Using Replicon Now";
"  Sign up for a two week free trial!"="  Sign up for a two week free trial!";
"By registering you agree to Replicon's Terms of Service."="By registering you agree to Replicon's Terms of Service.";
"Start"="Start";
"Reset password"="Reset password";
"* You will use this at login"="* You will use this at login";
"Sign Up"="Sign Up";
"Please enter your Company"="Please enter your Company";
"Please enter your Email Address"="Please enter your Email Address";


//ChangePasswordViewController
"Change Password"="Change Password";
"The values do not match."="The values do not match.";
"Please complete all fields."="Please complete all fields.";
"Change Password?"="Change Password?";

//ResubmitTimesheetViewController

"Please indicate a reason for resubmitting this timesheet"="Please indicate a reason for resubmitting this timesheet";
"Please indicate a reason for resubmitting this expense"="Please indicate a reason for resubmitting this expense";




"Tasks in grey can't be selected for time entry."="Tasks in grey can't be selected for time entry.";

//TimeEntryViewController
"No tasks"="No tasks";
"In progress"="In progress";
"Permanently Delete Time Entry?"="Permanently Delete Time Entry?";

//resetPasswordViewController
"Use this form to request a password reset. We'll send you an email with a link to complete the process."="Use this form to request a password reset. We'll send you an email with a link to complete the process.";
"We've received your request to reset your password. Please check your email inbox to complete the process.\
\n\nIf you need additional help, please email us at: support@replicon.com."="We've received your request to reset your password. Please check your email inbox to complete the process.\
\n\nIf you need additional help, please email us at: support@replicon.com.";



//expenseEntrycellView
"Project"="Project";
"Type"="Type";
"Currency"="Currency";
"Amount"="Amount";
"Date"="Date";
"Description"="Description";
"Bill Client"="Bill Client";
"Receipt Photo"="Receipt Photo";
"Reimburse"="Reimburse";
"Expense Dropdown UDF"="Expense Dropdown UDF";
"Expense Number UDF"="Expense Number UDF";
"Expense Date UDF"="Expense Date UDF";
"Expense Text UDF"="Expense Text UDF";

//timeEntryCellView
"Billing"="Billing";
"Activity"="Activity";

"DUE"="DUE";
"Booking"="Booking";

"Time In"="Time In";
"Time Out"="Time Out";
"Hours"="Hours";

"No project"="No project";
"No activity"="No activity";
"Default Text"="Default Text";
"Location"="Location";
"No UDFs edited"="No UDFs edited";
"Rate"="Rate";
"Reimburse Currency"="Reimburse Currency";
"Payment Method"="Payment Method";
"Yes"="Yes";
"Clear"="Clear";
"Close Later"="Close Later";
"Close Now"="Close Now";
"Your Replicon language preference is set to"="Your Replicon language preference is set to";
"To enable this language on mobile, please quit and restart the app."="To enable this language on mobile, please quit and restart the app.";


//Approvals
"All timesheets approved\nNone pending"="All timesheets approved\nNone pending";


//AmountViewController US4335/US4336

"Quantity"="Quantity";
"Pre-Tax Amount"="Pre-Tax Amount";
"Taxes"="Taxes";

//ResubmitViewController  US4275
"timesheet for approval?"="timesheet for approval?";
"expense for approval?"="expense for approval?";

//AmountViewController US4335/US4336
"Add Expense Entry"="Add Expense Entry";
"Edit Expense Entry"="Edit Expense Entry";
"View Expense Entry"="View Expense Entry";
"Sheet Name"="Sheet Name";
"TOTAL AMOUNT" = "TOTAL AMOUNT";
"View Time Entry"="View Time Entry";
"Clock"="Clock";


//Approvals Validation Exception
"There is a technical problem preventing the selected timesheet(s) from being approved or rejected in the mobile app. We're working hard to resolve the issue. In the meantime, please log in to Replicon on your computer's browser to approve the timesheet(s)."="There is a technical problem preventing the selected timesheet(s) from being approved or rejected in the mobile app. We're working hard to resolve the issue. In the meantime, please log in to Replicon on your computer's browser to approve the timesheet(s).";


//ATTESTATION

"Please read and accept the"="Please read and accept the";
"to continue."="to continue.";


//US4337//Replacing Webtimesheet With Replicon

"This receipt is in a format not supported by the image viewer \n \n Please log in to Replicon to view the receipt" = "This receipt is in a format not supported by the image viewer \n \n Please log in to Replicon to view the receipt";

"Custom timesheet level (UDFs) are currently not supported in the Replicon Mobile app.  Please log in to Replicon through a browser to enter time." = "Custom timesheet level (UDFs) are currently not supported in the Replicon Mobile app.  Please log in to Replicon through a browser to enter time.";

"You do not have permission to use the mobile Locked In/Out timesheet.  Please contact your Replicon administrator to have this permission enabled." = "You do not have permission to use the mobile Locked In/Out timesheet.  Please contact your Replicon administrator to have this permission enabled.";

"The Replicon Mobile app does not support Locked In/Out timesheets with required fields.  Please enter time in Replicon through a browser." = "The Replicon Mobile app does not support Locked In/Out timesheets with required fields.  Please enter time in Replicon through a browser.";

"Please log in to Replicon through your browser to set this field and submit the timesheet." = "Please log in to Replicon through your browser to set this field and submit the timesheet.";

"You must change your password before using Replicon Mobile.\n\nPlease log in to Replicon in a browser to change the password." = "You must change your password before using Replicon Mobile.\n\nPlease log in to Replicon in a browser to change the password.";

"This receipt is too large to download or the connection speed is too slow. \n \nPlease log in to Replicon on a PC to view the receipt" = "This receipt is too large to download or the connection speed is too slow. \n \nPlease log in to Replicon on a PC to view the receipt";


"This entry cannot be edited because the stopwatch is running in Replicon."="This entry cannot be edited because the stopwatch is running in Replicon.";

"Please visit Replicon through a browser to select your trial options.\n\nOnce complete, you can use Replicon Mobile to access your trial."="Please visit Replicon through a browser to select your trial options.\n\nOnce complete, you can use Replicon Mobile to access your trial.";


//SSO

"Welcome to Replicon Mobile!"="Welcome to Replicon Mobile!";
"Enter your company and user name to get started."="Enter your company and user name to get started.";
"Company Name"="Company";
"Go"="Go";
"Authentication Required"="Authentication Required";
"Submit"="Submit";
"User Name"="User Name";
"password"="Password";
"You may briefly experience a blank screen during the authentication process."="You may briefly experience a blank screen during the authentication process.";
"Incorrect User Name"="Incorrect User Name";
"Please enter your Company."="Please enter your Company.";
"Unknown Company.  Please check that it was entered correctly."="Unknown Company.  Please check that it was entered correctly.";

//Ad Hoc Time Off  


"Ad Hoc Time Off"="Ad Hoc Time Off";
"Time Off Type"="Time Off Type";
"Edit Time Off"="Edit Time Off Entry";
"View Time Off"="View Time Off Entry";
"Add Time Off"="Add Time Off Entry";
"Permanently delete time off entry?"="Permanently delete time off entry?";
"Please select a time off type."="Please select a time off type.";
"This entry is dated for a submitted timesheet.  Do you want to unsubmit the timesheet and add the entry?"="This entry is dated for a submitted timesheet.  Do you want to unsubmit the timesheet and add the entry?";
"Time Entry"="Time Entry";
"Work"="Work";

//MEAL BREAKS

"Meal"="Meal";
"Off"="Off";
"OT"="OT";
"Reg"="Reg";


//moreviewController
"This device is not configured for sending mail"="This device is not configured for sending mail";
"Sending Failed - Unknown Error :-("="Sending Failed - Unknown Error :-(";
"Email"="Email";
"Send Feedback"="Send Feedback";
"timesheet for approval"="timesheet for approval";
"Permanently Delete expense?"="Permanently Delete expense?";
"Permanently delete"="Permanently delete";
"for approval"="for approval";
"Review App"="Review App";
"Thank you! Your review will help us improve the app."="Thank you! Your review will help us improve the app.";
"No Thanks"="No Thanks";
"App Store"="App Store";
"Change Company / User"="Change Company / User";

//AppovedTimesheetNotWaiting
"This timesheet is no longer waiting for approval"="This timesheet is no longer waiting for approval";

//Reopen Timesheets
"Reopen"="Reopen";
"Please unsubmit or reopen your timesheet in order to punch in"="Please unsubmit or reopen your timesheet in order to punch in";
"Please unsubmit or reopen your timesheet in order to punch out"="Please unsubmit or reopen your timesheet in order to punch out";
"Reopening..."="Reopening...";
"Please unsubmit your timesheet in order to punch in"="Please unsubmit your timesheet in order to punch in";
"Please unsubmit your timesheet in order to punch out"="Please unsubmit your timesheet in order to punch out";
"This entry is dated for a submitted timesheet.  Do you want to reopen the timesheet and add the entry?"="This entry is dated for a submitted timesheet.  Do you want to reopen the timesheet and add the entry?";
//ReopenReason
"Please indicate a reason for reopening this timesheet"="Please indicate a reason for reopening this timesheet";


//APPROVALS
"Check All"="Check All";
"Clear All"="Clear All";

//TimeEntryViewController
"Invalid value.Please edit the value"="Invalid value.Please edit the value";

//Pagination

"Client"="Client";
"Choose client"="Choose client";
"Please select a project for the client or change the client selection to 'NONE'"="Please select a project for the client or change the client selection to 'NONE'";
"Filter Clients..."="Filter Clients...";
"Filter Projects..."="Filter Projects...";
"No Results"="No Results";
"Recent"="Recent";
"All"="All";
//Rename of Reimburse Currency in NewExpenseSheet
"Reimbursement Currency"="Reimbursement Currency";


//INCOMPATIBLE APP
"Your company is subscribed to a Replicon product that this app does not support. Please get the right app to continue."="Your company is subscribed to a Replicon product that this app does not support. Please get the right app to continue.";
"Incompatible App"="Incompatible App";
"Later"="Later";
"Get App"="Get App";
